content/main/20211222170720-52_book_challenge_project.md
+++
title = "52 Book Challenge Project"
author = ["System Administrator"]
draft = false
+++

## ACTIVE 52 Book Challenge Project <span class="tag"><span class="agenda">agenda</span><span class="daily">daily</span></span> {#active-52-book-challenge-project}

The Challenge is `Read a book a week`.


### The project Machine {#the-project-machine}

Pretty simple, just read one a week.

Take note, Mind maps, practice, essays where it seemed to be interesting, and a review of the book to prove I actually read it.

Record would be kept under [Record](#record)


#### NEXT Read {#next-read}

Read the next chunk of the current reading book, or if I have a plan, next chunk of the plan


### Record {#record}


#### Overall {#overall}

| Number | Name       | Author              | Time                                                                                                  |
|--------|------------|---------------------|-------------------------------------------------------------------------------------------------------|
| 1      | Psychimart | McGraw-Hill Editors | 1st week <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-12-22 Wed&gt;</span></span> |


#### Each Book {#each-book}

<!--list-separator-->

-  [CURRENT]1. Psychsmart by McGraw-Hill Editors

    This is a book about Psychology. It covers many fields I'm interested in, like neuroscience, conscious, memory, development, pretty much everything in the field of brain

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-12-24 Fri&gt; </span></span> Reading: General and Neuroscience perspective

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-04 Tue&gt; </span></span> Reading

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-05 Wed&gt; </span></span> Reading

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-06 Thu&gt; </span></span> Reading

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-07 Fri&gt; </span></span> Reading

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-08 Sat&gt; </span></span> Reading

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-09 Sun&gt; </span></span> Reading

    <!--list-separator-->

    -  <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-09 Sun&gt; </span></span> Reading

<!--list-separator-->

-  2. Flow by Mihaly Csikszentmihalyi

    A book about the Optimal experience.

<!--list-separator-->

-  American Gods by Neil Gaiman

    I kind of want to use this book as a model for my english writing.